Repository: SteffenCarlsen/Jagex-Account-Switcher
Catalog: Languages/Strings.*.resx
Languages: es, pt

# SettingsTitle
source: Settings
es: Configuraciones
pt: Configurações

source: Runelite Location
es: Ubicación de RuneLite
pt: Localização do RuneLite

source: Configurations Location
es: Ubicación de Configuraciones
pt: Localização das Configurações

# ConfigurationsPathWatermark
source: Path to store configurations
es: Ruta de las configuraciones
pt: Caminho das configurações

# RunelitePathWatermark
source: Path to RuneLite executable
es: Ruta del ejecutable RuneLite
pt: Caminho do executável RuneLite

# BrowseButton
source: Browse
es: Explorar
pt: Procurar

source: Microbot Jar Location
es: Ubicación del JAR de Microbot
pt: Localização do JAR do Microbot

# MicrobotJarPathWatermark
source: Path to the Microbot Jar file
es: Ruta del archivo JAR de Microbot
pt: Caminho do arquivo JAR do Microbot

source: Language
es: Idioma
pt: Idioma

source: Account
es: Cuenta
pt: Conta

source: Process ID
es: ID de Proceso
pt: ID do Processo

source: Process Lifetime
es: Tiempo de Vida del Proceso
pt: Tempo de Vida do Processo

source: Actions
es: Acciones
pt: Ações

source: Start
es: Iniciar
pt: Iniciar

source: Kill
es: Terminar
pt: Encerrar

source: Update Delay (ms):
es: Retraso de Actualización (ms):
pt: Atraso de Atualização (ms):

source: Start All
es: Iniciar Todos
pt: Iniciar Todos

# MassStartTooltip
source: Start all accounts with a delay between each one
es: Iniciar todas las cuentas con un retraso entre cada una
pt: Iniciar todas as contas com um atraso entre cada uma

source: Show Debug Console
es: Mostrar Consola de Depuración
pt: Mostrar Console de Depuração

# WelcomeMessage
source: Welcome to Jagex Account Switcher
es: Bienvenido al Cambiador de Cuentas de Jagex
pt: Bem-vindo ao Alternador de Contas Jagex

source: Account Name
es: Nombre de Cuenta
pt: Nome da Conta

source: Active
es: Activa
pt: Ativa

source: Has Client Arguments
es: Tiene Argumentos de Cliente
pt: Tem Argumentos de Cliente

source: Switch to Account
es: Cambiar a Cuenta
pt: Mudar para Conta

source: Set Client Arguments
es: Establecer Argumentos de Cliente
pt: Definir Argumentos de Cliente

source: Import Account
es: Importar Cuenta
pt: Importar Conta

source: Refresh Active Account
es: Actualizar Cuenta Activa
pt: Atualizar Conta Ativa

source: Delete
es: Eliminar
pt: Excluir

source: Setup Guide
es: Guía de Configuración
pt: Guia de Configuração

# Step1Title
source: Getting Started
es: Primeros Pasos
pt: Primeiros Passos

# Step1Description
source: Follow these steps to set up your account switcher:
es: Sigue estos pasos para configurar tu cambiador de cuentas:
pt: Siga estes passos para configurar seu alternador de contas:

# Step1Point1
source: Set the RuneLite path in the Settings tab
es: Establece la ruta de RuneLite en la pestaña de Configuraciones
pt: Defina o caminho do RuneLite na aba Configurações

# Step1Point2
source: Set the Configurations path where your profiles will be stored
es: Establece la ruta de Configuraciones donde se guardarán tus perfiles
pt: Defina o caminho de Configurações onde seus perfis serão armazenados

# Step1Point3
source: Import your first account from the Accounts tab
es: Importa tu primera cuenta desde la pestaña de Cuentas
pt: Importe sua primeira conta na aba Contas

# Step1Point4
source: Use the "Switch to Account" button to activate an account
es: Usa el botón "Cambiar a Cuenta" para activar una cuenta
pt: Use o botão "Mudar para Conta" para ativar uma conta

# Step2Title
source: Advanced Features
es: Características Avanzadas
pt: Recursos Avançados

# Step2Description
source: Once you're familiar with the basics, you can:
es: Una vez que estés familiarizado con lo básico, puedes:
pt: Depois de se familiarizar com o básico, você pode:

# Step2Point1
source: Set custom client arguments for each account
es: Establecer argumentos de cliente personalizados para cada cuenta
pt: Definir argumentos de cliente personalizados para cada conta

# Step2Point2
source: Use the Mass Account Handler to launch multiple clients
es: Usar el Gestor de Cuentas Masivo para iniciar múltiples clientes
pt: Usar o Gerenciador de Contas em Massa para iniciar vários clientes

# Step2Point3
source: Import Microbot for automated tasks
es: Importar Microbot para tareas automatizadas
pt: Importar o Microbot para tarefas automatizadas

# Step2Point4
source: Customize the application language
es: Personalizar el idioma de la aplicación
pt: Personalizar o idioma da aplicação

# WarningMessage
source: Warning: Make sure to keep your account information secure. This application only stores data locally on your device.
es: Advertencia: Asegúrate de mantener segura la información de tu cuenta. Esta aplicación solo almacena datos localmente en tu dispositivo.
pt: Aviso: Certifique-se de manter as informações da sua conta seguras. Esta aplicação armazena dados apenas localmente no seu dispositivo.

# SetClientArgumentsBuilder
source: Client Arguments Builder
es: Constructor de Argumentos de Cliente
pt: Construtor de Argumentos de Cliente

source: Client Options
es: Opciones del Cliente
pt: Opções do Cliente

source: Clean Jagex Launcher
es: Limpiar Lanzador de Jagex
pt: Limpar Launcher da Jagex

# CleanJagexLauncherDescription
source: Remove Jagex launcher integration
es: Eliminar integración con el lanzador de Jagex
pt: Remover integração com o launcher da Jagex

source: Developer Mode
es: Modo Desarrollador
pt: Modo Desenvolvedor

# DeveloperModeDescription
source: Enable developer tools and logging
es: Habilitar herramientas y registro para desarrolladores
pt: Ativar ferramentas e registro para desenvolvedores

source: Debug Mode
es: Modo Depuración
pt: Modo de Depuração

# DebugModeDescription
source: Enable additional debugging options
es: Habilitar opciones adicionales de depuración
pt: Ativar opções adicionais de depuração

source: Microbot Debug
es: Depuración de Microbot
pt: Depuração do Microbot

# MicrobotDebugDescription
source: Enable Microbot debugging features
es: Habilitar características de depuración de Microbot
pt: Ativar recursos de depuração do Microbot

source: Safe Mode
es: Modo Seguro
pt: Modo Seguro

# SafeModeDescription
source: Disable external plugins
es: Deshabilitar complementos externos
pt: Desativar plugins externos

source: Insecure Skip TLS
es: Saltar TLS Inseguro
pt: Ignorar TLS Inseguro

# InsecureSkipTlsDescription
source: Skip TLS certificate validation (not recommended)
es: Omitir la validación de certificados TLS (no recomendado)
pt: Ignorar validação de certificados TLS (não recomendado)

source: Disable Telemetry
es: Deshabilitar Telemetría
pt: Desativar Telemetria

# DisableTelemetryDescription
source: Prevent sending usage statistics
es: Evitar envío de estadísticas de uso
pt: Evitar envio de estatísticas de uso

source: Disable Walker Update
es: Deshabilitar Actualización del Walker
pt: Desativar Atualização do Walker

# DisableWalkerUpdateDescription
source: Prevent automatic updates to the walker component
es: Evitar actualizaciones automáticas del componente walker
pt: Evitar atualizações automáticas do componente walker

source: No Update
es: Sin Actualización
pt: Sem Atualização

# NoUpdateDescription
source: Skip checking for RuneLite updates
es: Omitir comprobación de actualizaciones de RuneLite
pt: Pular verificação de atualizações do RuneLite

source: Options With Values
es: Opciones Con Valores
pt: Opções Com Valores

source: JavConfig URL
es: URL de JavConfig
pt: URL do JavConfig

# JavConfigUrlWatermark
source: Enter URL for JavConfig
es: Introduce URL para JavConfig
pt: Digite URL para JavConfig

source: Profile
es: Perfil
pt: Perfil

# ProfileWatermark
source: Enter profile name
es: Introduce nombre del perfil
pt: Digite o nome do perfil

source: Proxy Type
es: Tipo de Proxy
pt: Tipo de Proxy

source: None
es: Ninguno
pt: Nenhum

source: Proxy Host
es: Host del Proxy
pt: Host do Proxy

# ProxyHostWatermark
source: Enter host address
es: Introduce dirección del host
pt: Digite o endereço do host

source: Proxy Port
es: Puerto del Proxy
pt: Porta do Proxy

# ProxyPortWatermark
source: Enter port number
es: Introduce número de puerto
pt: Digite o número da porta

source: Proxy Username
es: Usuario del Proxy
pt: Usuário do Proxy

# ProxyUsernameWatermark
source: Enter username
es: Introduce nombre de usuario
pt: Digite o nome de usuário

source: Proxy Password
es: Contraseña del Proxy
pt: Senha do Proxy

# ProxyPasswordWatermark
source: Enter password
es: Introduce contraseña
pt: Digite a senha

source: Raw Arguments
es: Argumentos Sin Procesar
pt: Argumentos Brutos

source: Cancel
es: Cancelar
pt: Cancelar

source: OK
es: Aceptar

# WindowTitle
source: Jagex Account Switcher
es: Cambiar de Cuenta Jagex
pt: Alternador de Contas Jagex

source: Navigation
es: Navegación
pt: Navegação

source: Account Overview
es: Resumen de Cuentas
pt: Visão Geral das Contas

source: Account Handler
es: Gestor de Cuentas
pt: Gerenciador de Contas

source: Settings
es: Configuraciones
pt: Configurações

source: Guide
es: Guía
pt: Guia

source: Grouping
es: Agrupamiento
pt: Agrupamento

# AccountGroupingTitle
source: Account Grouping
es: Agrupación de Cuentas
pt: Agrupamento de Contas

source: Groups
es: Grupos
pt: Grupos

# NewGroup
source: New
es: Nuevo
pt: Novo

# EditGroup
source: Edit
es: Editar
pt: Editar

# DeleteGroup
source: Delete
es: Eliminar
pt: Excluir

source: Group Details
es: Detalles del Grupo
pt: Detalhes do Grupo

# GroupName
source: Name
es: Nombre
pt: Nome

# SaveGroup
source: Save
es: Guardar
pt: Salvar

source: Assign Accounts
es: Asignar Cuentas
pt: Atribuir Contas

source: Available Accounts
es: Cuentas Disponibles
pt: Contas Disponíveis

# GroupAccounts
source: Group Members
es: Miembros del Grupo
pt: Membros do Grupo

source: Start Group
es: Iniciar Grupo
pt: Iniciar Grupo

source: Stop Group
es: Detener Grupo
pt: Parar Grupo

# DeleteJars
source: Delete old jar-files
es: Eliminar archivos jar antiguos
pt: Excluir arquivos jar antigos

# GroupColor
source: Color
pt: Cor
